In [1]:
import pandas as pd
import numpy as np

In [2]:
#-------------------series-------------------


s=pd.Series([10,20,30,40,50])
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
s.dtype

dtype('int64')

In [4]:
s.values

array([10, 20, 30, 40, 50], dtype=int64)

In [5]:
s.shape

(5,)

In [6]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
s.name="numbers"
s

0    10
1    20
2    30
3    40
4    50
Name: numbers, dtype: int64

In [8]:
s[0]

10

In [9]:
s[0:4]

0    10
1    20
2    30
3    40
Name: numbers, dtype: int64

In [10]:
s.iloc[2]

30

In [11]:
s.iloc[1]

20

In [12]:
s.loc[1:2]

1    20
2    30
Name: numbers, dtype: int64

In [13]:
index=["prasanna","spandana","haru","harshitha","ammu"]
index

['prasanna', 'spandana', 'haru', 'harshitha', 'ammu']

In [14]:
s.index=index
s

prasanna     10
spandana     20
haru         30
harshitha    40
ammu         50
Name: numbers, dtype: int64

In [15]:
s['prasanna']

10

In [16]:
s.iloc[1]

20

In [17]:
s.loc["prasanna"]

10

In [18]:
s.loc["haru"]

30

In [19]:
students_attendance={
    "prasanna":30,
    "harika":40,
    "harshitha":65,
    "spandana":85,
    "ammu":35,
    "teddy":45,
    "srivani":78
}

In [20]:
s2=pd.Series(students_attendance)

In [21]:
s2>50

prasanna     False
harika       False
harshitha     True
spandana      True
ammu         False
teddy        False
srivani       True
dtype: bool

s2<50

In [22]:
s2<50

prasanna      True
harika        True
harshitha    False
spandana     False
ammu          True
teddy         True
srivani      False
dtype: bool

In [23]:
s2[s2>50]

harshitha    65
spandana     85
srivani      78
dtype: int64

In [24]:
s2[(s2 > 40) & (s2 < 80)]

harshitha    65
teddy        45
srivani      78
dtype: int64

In [25]:
s2[~(s2>50)]

prasanna    30
harika      40
ammu        35
teddy       45
dtype: int64

In [26]:
s2["prasanna"]=90

In [27]:
s2

prasanna     90
harika       40
harshitha    65
spandana     85
ammu         35
teddy        45
srivani      78
dtype: int64

In [31]:
#--------------Data frame------------------------------------


data = {
    "name": ["prasanna", "harika", "harshitha", "spandana", "teddy"],
    "age": [21, 20, 21, 18, np.nan],
    "department": ["IT", "FARMA", "IT", "MECH", "IT"],
    "salary": [50000, 20000, 50000, np.nan, 40000]
}
df=pd.DataFrame(data)
df

        name   age department   salary
0   prasanna  21.0         IT  50000.0
1     harika  20.0      FARMA  20000.0
2  harshitha  21.0         IT  50000.0
3   spandana  18.0       MECH      NaN
4      teddy   NaN         IT  40000.0

In [32]:
df.tail()

        name   age department   salary
0   prasanna  21.0         IT  50000.0
1     harika  20.0      FARMA  20000.0
2  harshitha  21.0         IT  50000.0
3   spandana  18.0       MECH      NaN
4      teddy   NaN         IT  40000.0

In [33]:
df.tail(2)

       name   age department   salary
3  spandana  18.0       MECH      NaN
4     teddy   NaN         IT  40000.0

In [34]:
df.head(2)

       name   age department   salary
0  prasanna  21.0         IT  50000.0
1    harika  20.0      FARMA  20000.0

In [41]:
df.loc[1,"age"]

20.0

In [44]:
df.loc[0, "age"]

21.0

In [47]:
df["age"]=df["age"]+5
df

        name   age department   salary
0   prasanna  31.0         IT  50000.0
1     harika  30.0      FARMA  20000.0
2  harshitha  31.0         IT  50000.0
3   spandana  28.0       MECH      NaN
4      teddy   NaN         IT  40000.0

In [52]:
df.["department"].value_counts()

SyntaxError: invalid syntax (1300905969.py, line 1)